app/controllers/preorder_controller.rb

  def prefill
    @user = User.find_or_create_by(:email => params[:email])
---
INSERT INTO "users" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 09 Feb 2014 17:43:28 PST -08:00], ["email", "sanchocuba@gmail.com"], ["updated_at", Sun, 09 Feb 2014 17:43:28 PST -08:00]]
SELECT "users".* FROM "users" WHERE "users"."email" = 'sanchocuba@gmail.com' LIMIT 1