app/views/preorder/_payment_options.html.erb

      <ol>
        <% PaymentOption.all.each_with_index do |p, index| %>
---
SELECT "payment_options".* FROM "payment_options"